Управление_ИТФирмой/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипКонтрогента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_ИТФирмой/src/Enums/ТипКонтрогента/ТипКонтрогента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипКонтрогента</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Управление_ИТФирмой/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьВидимость(Объект, Элементы);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИННПриИзмененииФрагмент();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость(Объект, Элементы);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимость(Объект, Элементы);
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипКонтрогента.ФизическоеЛицо") Тогда
		Объект.КПП = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Расшифровки = Новый Соответствие;
	Расшифровки.Вставить("ООО", "Общество с ограниченной ответственностью");
	Расшифровки.Вставить("АО", "Акционерное общество");
	Расшифровки.Вставить("ПАО", "Публичное акционерное общество");
	Расшифровки.Вставить("ЗАО", "Закрытое акционерное общество");
	Расшифровки.Вставить("ТОВ", "Товарищество с ограниченной ответственностью");
	Расшифровки.Вставить("ТСЖ", "Товарищество собственников жилья");
	Расшифровки.Вставить("СНТ", "Садоводческое некоммерческое товарищество");
	Расшифровки.Вставить("ИП", "Индивидуальный предприниматель");
	Расшифровки.Вставить("КФХ", "Глава крестьянского (фермерского) хозяйства");
	
	
	МассивНазвания = СтрРазделить (Объект.Наименование, " ",);
	ПолноеНазвание = Новый Массив;
	Для Каждого Слово из МассивНазвания Цикл 
		
		Расшифровка = Расшифровки[Слово];
		
		Если НЕ Расшифровка = Неопределено Тогда
			Слово = Расшифровка;
		КонецЕсли;
		
		ПолноеНазвание.Добавить(Слово)
		
	КонецЦикла;	
	
	ПолноеНазвание = СтрСоединить (ПолноеНазвание, " ");
	
	Если Объект.ПолноеНаименование = "" Тогда
		Объект.ПолноеНаименование = ПолноеНазвание;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Объект, Элементы)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипКонтрогента.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
		Элементы.Пол.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Ложь;
		Элементы.Пол.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ИННПриИзмененииФрагмент()
	
	Перем ЕстьОшибка, ТекстОшибки;
	
	ТекстОшибки= "";
	ЕстьОшибка = Ложь;
	Если НЕ РаботаСИНН.ПроверкаИНН(Объект.ИНН, ЕстьОшибка, ТекстОшибки) Тогда
		Если ЕстьОшибка = Истина Тогда
			Элементы.ИНН.ЦветТекста = WebЦвета.Розовый;
			Элементы.ОшибкаИНН.Заголовок = ТекстОшибки;
			Элементы.ИНН.Видимость = Истина;
		ИначеЕсли ЕстьОшибка =Ложь Тогда
			Элементы.ИНН.ЦветТекста = WebЦвета.Розовый;
			Элементы.ОшибкаИНН.Заголовок = "Проерка контрольного разряда ИНН не пройдена, проверьте ИНН.";
			Элементы.ИНН.Видимость = Истина;
		Иначе
			Элементы.ИНН.ЦветТекста = Новый Цвет;
			Элементы.ИНН.Видимость = Ложь;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
